zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/abdacb.h
/**
 * \file
 *
 * \brief Component description for ABDACB
 *
 * Copyright (c) 2016 Atmel Corporation,
 *                    a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the Licence at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAM4L_ABDACB_COMPONENT_
#define _SAM4L_ABDACB_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR ABDACB */
/* ========================================================================== */
/** \addtogroup SAM4L_ABDACB Audio Bitstream DAC */
/*@{*/

#define ABDACB_I7563
#define REV_ABDACB                  0x100

/* -------- ABDACB_CR : (ABDACB Offset: 0x00) (R/W 32) Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t EN:1;             /*!< bit:      0  Enable                             */
    uint32_t SWAP:1;           /*!< bit:      1  Swap Channels                      */
    uint32_t :1;               /*!< bit:      2  Reserved                           */
    uint32_t ALTUPR:1;         /*!< bit:      3  Alternative up-sampling ratio      */
    uint32_t CMOC:1;           /*!< bit:      4  Common mode offset control         */
    uint32_t MONO:1;           /*!< bit:      5  Mono mode                          */
    uint32_t :1;               /*!< bit:      6  Reserved                           */
    uint32_t SWRST:1;          /*!< bit:      7  Software reset                     */
    uint32_t :8;               /*!< bit:  8..15  Reserved                           */
    uint32_t DATAFORMAT:3;     /*!< bit: 16..18  Data word format                   */
    uint32_t :5;               /*!< bit: 19..23  Reserved                           */
    uint32_t FS:4;             /*!< bit: 24..27  Sampling frequency                 */
    uint32_t :4;               /*!< bit: 28..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ABDACB_CR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ABDACB_CR_OFFSET            0x00         /**< \brief (ABDACB_CR offset) Control Register */
#define ABDACB_CR_RESETVALUE        _U_(0x00000000); /**< \brief (ABDACB_CR reset_value) Control Register */

#define ABDACB_CR_EN_Pos            0            /**< \brief (ABDACB_CR) Enable */
#define ABDACB_CR_EN                (_U_(0x1) << ABDACB_CR_EN_Pos)
#define   ABDACB_CR_EN_0_Val              _U_(0x0)   /**< \brief (ABDACB_CR) Audio DAC is disabled */
#define   ABDACB_CR_EN_1_Val              _U_(0x1)   /**< \brief (ABDACB_CR) Audio DAC is enabled */
#define ABDACB_CR_EN_0              (ABDACB_CR_EN_0_Val            << ABDACB_CR_EN_Pos)
#define ABDACB_CR_EN_1              (ABDACB_CR_EN_1_Val            << ABDACB_CR_EN_Pos)
#define ABDACB_CR_SWAP_Pos          1            /**< \brief (ABDACB_CR) Swap Channels */
#define ABDACB_CR_SWAP              (_U_(0x1) << ABDACB_CR_SWAP_Pos)
#define   ABDACB_CR_SWAP_0_Val            _U_(0x0)   /**< \brief (ABDACB_CR) The CHANNEL0 and CHANNEL1 samples will not be swapped when writing the Audio DAC Sample Data Register (SDR) */
#define   ABDACB_CR_SWAP_1_Val            _U_(0x1)   /**< \brief (ABDACB_CR) The CHANNEL0 and CHANNEL1 samples will be swapped when writing the Audio DAC Sample Data Register (SDR) */
#define ABDACB_CR_SWAP_0            (ABDACB_CR_SWAP_0_Val          << ABDACB_CR_SWAP_Pos)
#define ABDACB_CR_SWAP_1            (ABDACB_CR_SWAP_1_Val          << ABDACB_CR_SWAP_Pos)
#define ABDACB_CR_ALTUPR_Pos        3            /**< \brief (ABDACB_CR) Alternative up-sampling ratio */
#define ABDACB_CR_ALTUPR            (_U_(0x1) << ABDACB_CR_ALTUPR_Pos)
#define ABDACB_CR_CMOC_Pos          4            /**< \brief (ABDACB_CR) Common mode offset control */
#define ABDACB_CR_CMOC              (_U_(0x1) << ABDACB_CR_CMOC_Pos)
#define ABDACB_CR_MONO_Pos          5            /**< \brief (ABDACB_CR) Mono mode */
#define ABDACB_CR_MONO              (_U_(0x1) << ABDACB_CR_MONO_Pos)
#define ABDACB_CR_SWRST_Pos         7            /**< \brief (ABDACB_CR) Software reset */
#define ABDACB_CR_SWRST             (_U_(0x1) << ABDACB_CR_SWRST_Pos)
#define ABDACB_CR_DATAFORMAT_Pos    16           /**< \brief (ABDACB_CR) Data word format */
#define ABDACB_CR_DATAFORMAT_Msk    (_U_(0x7) << ABDACB_CR_DATAFORMAT_Pos)
#define ABDACB_CR_DATAFORMAT(value) (ABDACB_CR_DATAFORMAT_Msk & ((value) << ABDACB_CR_DATAFORMAT_Pos))
#define ABDACB_CR_FS_Pos            24           /**< \brief (ABDACB_CR) Sampling frequency */
#define ABDACB_CR_FS_Msk            (_U_(0xF) << ABDACB_CR_FS_Pos)
#define ABDACB_CR_FS(value)         (ABDACB_CR_FS_Msk & ((value) << ABDACB_CR_FS_Pos))
#define ABDACB_CR_MASK              _U_(0x0F0700BB) /**< \brief (ABDACB_CR) MASK Register */

/* -------- ABDACB_SDR0 : (ABDACB Offset: 0x04) (R/W 32) Sample Data Register 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t DATA:32;          /*!< bit:  0..31  Sample Data                        */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ABDACB_SDR0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ABDACB_SDR0_OFFSET          0x04         /**< \brief (ABDACB_SDR0 offset) Sample Data Register 0 */
#define ABDACB_SDR0_RESETVALUE      _U_(0x00000000); /**< \brief (ABDACB_SDR0 reset_value) Sample Data Register 0 */

#define ABDACB_SDR0_DATA_Pos        0            /**< \brief (ABDACB_SDR0) Sample Data */
#define ABDACB_SDR0_DATA_Msk        (_U_(0xFFFFFFFF) << ABDACB_SDR0_DATA_Pos)
#define ABDACB_SDR0_DATA(value)     (ABDACB_SDR0_DATA_Msk & ((value) << ABDACB_SDR0_DATA_Pos))
#define ABDACB_SDR0_MASK            _U_(0xFFFFFFFF) /**< \brief (ABDACB_SDR0) MASK Register */

/* -------- ABDACB_SDR1 : (ABDACB Offset: 0x08) (R/W 32) Sample Data Register 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t DATA:32;          /*!< bit:  0..31  Sample Data                        */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ABDACB_SDR1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ABDACB_SDR1_OFFSET          0x08         /**< \brief (ABDACB_SDR1 offset) Sample Data Register 1 */
#define ABDACB_SDR1_RESETVALUE      _U_(0x00000000); /**< \brief (ABDACB_SDR1 reset_value) Sample Data Register 1 */

#define ABDACB_SDR1_DATA_Pos        0            /**< \brief (ABDACB_SDR1) Sample Data */
#define ABDACB_SDR1_DATA_Msk        (_U_(0xFFFFFFFF) << ABDACB_SDR1_DATA_Pos)
#define ABDACB_SDR1_DATA(value)     (ABDACB_SDR1_DATA_Msk & ((value) << ABDACB_SDR1_DATA_Pos))
#define ABDACB_SDR1_MASK            _U_(0xFFFFFFFF) /**< \brief (ABDACB_SDR1) MASK Register */

/* -------- ABDACB_VCR0 : (ABDACB Offset: 0x0C) (R/W 32) Volume Control Register 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t VOLUME:15;        /*!< bit:  0..14  Volume Control                     */
    uint32_t :16;              /*!< bit: 15..30  Reserved                           */
    uint32_t MUTE:1;           /*!< bit:     31  Mute                               */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ABDACB_VCR0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ABDACB_VCR0_OFFSET          0x0C         /**< \brief (ABDACB_VCR0 offset) Volume Control Register 0 */
#define ABDACB_VCR0_RESETVALUE      _U_(0x00000000); /**< \brief (ABDACB_VCR0 reset_value) Volume Control Register 0 */

