zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/abdacb.h
#define ABDACB_SR_BUSY_Pos          0            /**< \brief (ABDACB_SR) ABDACB Busy */
#define ABDACB_SR_BUSY              (_U_(0x1) << ABDACB_SR_BUSY_Pos)
#define ABDACB_SR_TXRDY_Pos         1            /**< \brief (ABDACB_SR) Transmit Ready */
#define ABDACB_SR_TXRDY             (_U_(0x1) << ABDACB_SR_TXRDY_Pos)
#define   ABDACB_SR_TXRDY_0_Val           _U_(0x0)   /**< \brief (ABDACB_SR) No Audio DAC TX Ready has occured since the last time ISR was read or since reset */
#define   ABDACB_SR_TXRDY_1_Val           _U_(0x1)   /**< \brief (ABDACB_SR) At least one Audio DAC TX Ready has occured since the last time ISR was read or since reset */
#define ABDACB_SR_TXRDY_0           (ABDACB_SR_TXRDY_0_Val         << ABDACB_SR_TXRDY_Pos)
#define ABDACB_SR_TXRDY_1           (ABDACB_SR_TXRDY_1_Val         << ABDACB_SR_TXRDY_Pos)
#define ABDACB_SR_TXUR_Pos          2            /**< \brief (ABDACB_SR) Transmit Underrun */
#define ABDACB_SR_TXUR              (_U_(0x1) << ABDACB_SR_TXUR_Pos)
#define   ABDACB_SR_TXUR_0_Val            _U_(0x0)   /**< \brief (ABDACB_SR) No Audio DAC Underrun has occured since the last time ISR was read or since reset */
#define   ABDACB_SR_TXUR_1_Val            _U_(0x1)   /**< \brief (ABDACB_SR) At least one Audio DAC Underrun has occured since the last time ISR was read or since reset */
#define ABDACB_SR_TXUR_0            (ABDACB_SR_TXUR_0_Val          << ABDACB_SR_TXUR_Pos)
#define ABDACB_SR_TXUR_1            (ABDACB_SR_TXUR_1_Val          << ABDACB_SR_TXUR_Pos)
#define ABDACB_SR_MASK              _U_(0x00000007) /**< \brief (ABDACB_SR) MASK Register */

/* -------- ABDACB_SCR : (ABDACB Offset: 0x24) ( /W 32) Status Clear Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :1;               /*!< bit:      0  Reserved                           */
    uint32_t TXRDY:1;          /*!< bit:      1  Transmit Ready Interrupt Clear     */
    uint32_t TXUR:1;           /*!< bit:      2  Transmit Underrun Interrupt Clear  */
    uint32_t :29;              /*!< bit:  3..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ABDACB_SCR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ABDACB_SCR_OFFSET           0x24         /**< \brief (ABDACB_SCR offset) Status Clear Register */
#define ABDACB_SCR_RESETVALUE       _U_(0x00000000); /**< \brief (ABDACB_SCR reset_value) Status Clear Register */

#define ABDACB_SCR_TXRDY_Pos        1            /**< \brief (ABDACB_SCR) Transmit Ready Interrupt Clear */
#define ABDACB_SCR_TXRDY            (_U_(0x1) << ABDACB_SCR_TXRDY_Pos)
#define   ABDACB_SCR_TXRDY_0_Val          _U_(0x0)   /**< \brief (ABDACB_SCR) No effect */
#define   ABDACB_SCR_TXRDY_1_Val          _U_(0x1)   /**< \brief (ABDACB_SCR) Clear the Audio DAC TX Ready interrupt */
#define ABDACB_SCR_TXRDY_0          (ABDACB_SCR_TXRDY_0_Val        << ABDACB_SCR_TXRDY_Pos)
#define ABDACB_SCR_TXRDY_1          (ABDACB_SCR_TXRDY_1_Val        << ABDACB_SCR_TXRDY_Pos)
#define ABDACB_SCR_TXUR_Pos         2            /**< \brief (ABDACB_SCR) Transmit Underrun Interrupt Clear */
#define ABDACB_SCR_TXUR             (_U_(0x1) << ABDACB_SCR_TXUR_Pos)
#define   ABDACB_SCR_TXUR_0_Val           _U_(0x0)   /**< \brief (ABDACB_SCR) No effect */
#define   ABDACB_SCR_TXUR_1_Val           _U_(0x1)   /**< \brief (ABDACB_SCR) Clear the Audio DAC Underrun interrupt */
#define ABDACB_SCR_TXUR_0           (ABDACB_SCR_TXUR_0_Val         << ABDACB_SCR_TXUR_Pos)
#define ABDACB_SCR_TXUR_1           (ABDACB_SCR_TXUR_1_Val         << ABDACB_SCR_TXUR_Pos)
#define ABDACB_SCR_MASK             _U_(0x00000006) /**< \brief (ABDACB_SCR) MASK Register */

/* -------- ABDACB_PARAMETER : (ABDACB Offset: 0x28) (R/  32) Parameter Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} ABDACB_PARAMETER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ABDACB_PARAMETER_OFFSET     0x28         /**< \brief (ABDACB_PARAMETER offset) Parameter Register */
#define ABDACB_PARAMETER_RESETVALUE _U_(0x00000000); /**< \brief (ABDACB_PARAMETER reset_value) Parameter Register */
#define ABDACB_PARAMETER_MASK       _U_(0xFFFFFFFF) /**< \brief (ABDACB_PARAMETER) MASK Register */

/* -------- ABDACB_VERSION : (ABDACB Offset: 0x2C) (R/  32) Version Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t VERSION:12;       /*!< bit:  0..11  Version Number                     */
    uint32_t :4;               /*!< bit: 12..15  Reserved                           */
    uint32_t VARIANT:4;        /*!< bit: 16..19  Variant Number                     */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ABDACB_VERSION_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ABDACB_VERSION_OFFSET       0x2C         /**< \brief (ABDACB_VERSION offset) Version Register */
#define ABDACB_VERSION_RESETVALUE   _U_(0x00000100); /**< \brief (ABDACB_VERSION reset_value) Version Register */

#define ABDACB_VERSION_VERSION_Pos  0            /**< \brief (ABDACB_VERSION) Version Number */
#define ABDACB_VERSION_VERSION_Msk  (_U_(0xFFF) << ABDACB_VERSION_VERSION_Pos)
#define ABDACB_VERSION_VERSION(value) (ABDACB_VERSION_VERSION_Msk & ((value) << ABDACB_VERSION_VERSION_Pos))
#define ABDACB_VERSION_VARIANT_Pos  16           /**< \brief (ABDACB_VERSION) Variant Number */
#define ABDACB_VERSION_VARIANT_Msk  (_U_(0xF) << ABDACB_VERSION_VARIANT_Pos)
#define ABDACB_VERSION_VARIANT(value) (ABDACB_VERSION_VARIANT_Msk & ((value) << ABDACB_VERSION_VARIANT_Pos))
#define ABDACB_VERSION_MASK         _U_(0x000F0FFF) /**< \brief (ABDACB_VERSION) MASK Register */

/** \brief ABDACB hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
 struct {
  __IO ABDACB_CR_Type            CR;          /**< \brief Offset: 0x00 (R/W 32) Control Register */
  __IO ABDACB_SDR0_Type          SDR0;        /**< \brief Offset: 0x04 (R/W 32) Sample Data Register 0 */
  __IO ABDACB_SDR1_Type          SDR1;        /**< \brief Offset: 0x08 (R/W 32) Sample Data Register 1 */
  __IO ABDACB_VCR0_Type          VCR0;        /**< \brief Offset: 0x0C (R/W 32) Volume Control Register 0 */
  __IO ABDACB_VCR1_Type          VCR1;        /**< \brief Offset: 0x10 (R/W 32) Volume Control Register 1 */
  __O  ABDACB_IER_Type           IER;         /**< \brief Offset: 0x14 ( /W 32) Interrupt Enable Register */
  __O  ABDACB_IDR_Type           IDR;         /**< \brief Offset: 0x18 ( /W 32) Interupt Disable Register */
  __I  ABDACB_IMR_Type           IMR;         /**< \brief Offset: 0x1C (R/  32) Interrupt Mask Register */
  __I  ABDACB_SR_Type            SR;          /**< \brief Offset: 0x20 (R/  32) Status Register */
  __O  ABDACB_SCR_Type           SCR;         /**< \brief Offset: 0x24 ( /W 32) Status Clear Register */
  __I  ABDACB_PARAMETER_Type     PARAMETER;   /**< \brief Offset: 0x28 (R/  32) Parameter Register */
  __I  ABDACB_VERSION_Type       VERSION;     /**< \brief Offset: 0x2C (R/  32) Version Register */
 } bf;
 struct {
  RwReg   ABDACB_CR;          /**< \brief (ABDACB Offset: 0x00) Control Register */
  RwReg   ABDACB_SDR0;        /**< \brief (ABDACB Offset: 0x04) Sample Data Register 0 */
  RwReg   ABDACB_SDR1;        /**< \brief (ABDACB Offset: 0x08) Sample Data Register 1 */
  RwReg   ABDACB_VCR0;        /**< \brief (ABDACB Offset: 0x0C) Volume Control Register 0 */
  RwReg   ABDACB_VCR1;        /**< \brief (ABDACB Offset: 0x10) Volume Control Register 1 */
  WoReg   ABDACB_IER;         /**< \brief (ABDACB Offset: 0x14) Interrupt Enable Register */
  WoReg   ABDACB_IDR;         /**< \brief (ABDACB Offset: 0x18) Interupt Disable Register */
  RoReg   ABDACB_IMR;         /**< \brief (ABDACB Offset: 0x1C) Interrupt Mask Register */
  RoReg   ABDACB_SR;          /**< \brief (ABDACB Offset: 0x20) Status Register */
  WoReg   ABDACB_SCR;         /**< \brief (ABDACB Offset: 0x24) Status Clear Register */
  RoReg   ABDACB_PARAMETER;   /**< \brief (ABDACB Offset: 0x28) Parameter Register */
  RoReg   ABDACB_VERSION;     /**< \brief (ABDACB Offset: 0x2C) Version Register */
 } reg;
} Abdacb;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAM4L_ABDACB_COMPONENT_ */
